IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/DMA_1.0.xml
        <register id="DMA_GEN_EVENT_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DMACH0" description="DMA Channel 0 interrupt signals that size counter reached zero (DMASZ=0)." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH1" description="DMA Channel 1 interrupt signals that size counter reached zero (DMASZ=0)." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH2" description="DMA Channel 2 interrupt signals that size counter reached zero (DMASZ=0)." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH3" description="DMA Channel 3 interrupt signals that size counter reached zero (DMASZ=0)." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH4" description="DMA Channel 4 interrupt signals that size counter reached zero (DMASZ=0)." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH5" description="DMA Channel 5 interrupt signals that size counter reached zero (DMASZ=0)." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="DMACH6" description="DMA Channel 6 interrupt signals that size counter reached zero (DMASZ=0)." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
            </bitfield>
            <bitfield id="PREIRQCH0" description="Pre-IRQ for Channel 0. Size counter reached Pre-IRQ threshold." begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH1" description="Pre-IRQ for Channel 1. Size counter reached Pre-IRQ threshold." begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="PREIRQCH2" description="Pre-IRQ for Channel 2. Size counter reached Pre-IRQ threshold." begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="ADDRERR" description="DMA address error, SRC address not reachable." begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
            <bitfield id="DATAERR" description="DMA data error, SRC data might be corrupted (PAR or ECC error)." begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear interrupt mask bit"/>
                <bitenum id="SET" value="0x1" description="Set interrupt mask bit"/>
            </bitfield>
        </register>
    </group>
    <register id="DMA_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="INT0_CFG" description="Event line mode select for event corresponding to interrupt event CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to generic event  GEN_EVENT" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
    <register id="DMA_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the DMA: number of DMA channel minus one  (e.g. 0-&gt;1ch, 2-&gt;3ch, 15-&gt;16ch)." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value (1 channel)"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest value (16 channel)"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="DMA_DMAPRIO" width="32" offset="0x1100" description="DMA Channel Priority Control">
        <bitfield id="ROUNDROBIN" description="Round robin. This bit enables the round-robin DMA channel priorities." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Roundrobin priority disabled, DMA channel priority is fixed: DMA0-DMA1-DMA2-...-DMA16"/>
            <bitenum id="ENABLE" value="0x1" description="Roundrobin priority enabled, DMA channel priority changes with each transfer"/>
        </bitfield>
        <bitfield id="BURSTSZ" description="Define the burst size of a block transfer, before the priority is re-evaluated" begin="17" end="16" width="2" rwaccess="R/W">
            <bitenum id="INFINITI" value="0x0" description="There is no burst size, the whole block transfer is completed on one transfer without interruption"/>
            <bitenum id="BURST_8" value="0x1" description="The burst size is 8, after 8 transfers the block transfer is interrupted and the priority is reevaluated"/>
            <bitenum id="BUSRT_16" value="0x2" description="The burst size is 16, after 16 transfers the block transfer is interrupted and the priority is reevaluated"/>
            <bitenum id="BURST_32" value="0x3" description="The burst size is 32, after 32 transfers the block transfer is interrupted and the priority is reevaluated"/>
        </bitfield>
    </register>
    <group id="DMA_DMATRIG" name="DMA_DMATRIG" instances="7" offset="0x1110" instaddr="0x4" description="">
        <register id="DMA_DMATCTL" width="32" offset="0x0" description="DMA Trigger Select">
            <bitfield id="DMATSEL" description="DMA Trigger Select 

Note: Reference the datasheet of the device to see the specific trigger mapping." begin="5" end="0" width="6" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
                <bitenum id="DMAREQ" value="0x0" description="Software trigger request"/>
                <bitenum id="MAXIMUM" value="0x3F" description="Highest possible value"/>
            </bitfield>
            <bitfield id="DMATINT" description="DMA Trigger by Internal Channel" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="EXTERNAL" value="0x0" description="DMATSEL will define external trigger select as transfer trigger."/>
                <bitenum id="INTERNAL" value="0x1" description="DMATSEL will define internal channel as transfer trigger select. 0-&gt; Channel0-done, 1-&gt; Channel1-done, ..."/>
            </bitfield>
        </register>
